In [65]:
import pandas as pd
import numpy as np

loc = 'fallcampdata/exped.xls'
df = pd.read_excel(loc)

In [97]:
df.head

<bound method NDFrame.head of      Transid       WHEN     WHERE                          WHAT      HOW  \
0          1 2002-11-30     Paris  Exploring in 10 Easy Lessons    Store
1          2 2002-10-20    London                  Camel saddle  Catalog
2          3 2002-11-07     Paris                       Compass    Store
3          4 2002-07-28    London        Geo positioning system    Store
4          5 2002-08-05     Paris                       Hammock    Store
5          6 2002-08-07     Paris                  Camel saddle    Store
6          7 2002-06-27     Paris        Geo positioning system    Store
7          8 2002-05-11    London        Geo positioning system    Store
8          9 2002-11-03     Paris                       Hammock    Store
9         10 2002-10-19    London                  Camel saddle  Catalog
10        11 2002-07-16    London            Boots - snakeproof    Store
11        12 2002-09-14     Paris        Geo positioning system    Store
12        13 2002-12-20    London    How to Win Foreign Friends    Store
13        14 2002-10-25    London                       Compass  Catalog
14        15 2002-03-30  New York                      Map case    Store
15        16 2002-09-07     Paris        Geo positioning system  Catalog
16        17 2002-07-30    London                       Hammock    Store
17        18 2002-12-13  New York           Elephant polo stick    Store
18        19 2002-04-29     Tokyo                  Camel saddle  Catalog
19        20 2002-07-10    London                       Hammock      Web
20        21 2002-02-07     Paris           Elephant polo stick  Catalog
21        22 2002-01-25     Paris          Hat - polar explorer    Store
22        23 2002-09-15    London    How to Win Foreign Friends  Catalog
23        24 2002-03-12     Paris                       Hammock  Catalog
24        25 2002-06-30    Sydney                       Compass    Store
25        26 2002-04-27     Paris        Geo positioning system    Store
26        27 2002-08-18     Paris                  Camel saddle    Store
27        28 2002-09-08    London                       Compass      Web
28        29 2002-10-04  New York                       Compass    Store
29        30 2002-11-28    London                       Hammock    Store
..       ...        ...       ...                           ...      ...
970      971 2002-10-02    London        Geo positioning system    Store
971      972 2002-02-03     Paris           Elephant polo stick    Store
972      973 2002-04-14     Tokyo        Geo positioning system    Store
973      974 2002-08-08     Paris                       Hammock    Store
974      975 2002-06-23     Paris          Hat - polar explorer    Store
975      976 2002-02-15     Tokyo        Geo positioning system  Catalog
976      977 2002-04-17    London          Hat - polar explorer  Catalog
977      978 2002-11-29     Paris          Hat - polar explorer  Catalog
978      979 2002-03-31    Sydney          Hat - polar explorer    Store
979      980 2002-06-04    Sydney    How to Win Foreign Friends    Store
980      981 2002-03-29     Tokyo                  Camel saddle    Store
981      982 2002-05-21     Tokyo          Hat - polar explorer    Store
982      983 2002-04-27    London           Elephant polo stick    Store
983      984 2002-11-15    Sydney                  Camel saddle    Store
984      985 2002-07-05    London                  Camel saddle    Store
985      986 2002-09-22    London                       Hammock    Store
986      987 2002-04-09    London                       Compass  Catalog
987      988 2002-01-25     Paris           Elephant polo stick    Store
988      989 2002-06-12    London        Geo positioning system  Catalog
989      990 2002-01-21     Paris                       Hammock    Store
990      991 2002-06-01     Paris          Hat - polar explorer  Catalog
991      992 2002-02-24  New York                      Map case    Store
992      993 2002-03-05     Paris           Elephant polo stick    Store
993      994 2002-07-14    London        Geo positioning system  Catalog
994      995 2002-04-07     Paris          Hat - polar explorer    Store
995      996 2002-02-10    London                  Camel saddle  Catalog
996      997 2002-03-13    London        Geo positioning system    Store
997      998 2002-09-22    London                      Map case    Store
998      999 2002-04-23  New York  Exploring in 10 Easy Lessons    Store
999     1000 2002-07-23  New York            Boots - snakeproof      Web

     QUANTITY  REVENUE  QUARTER
0           4       80        4
1           3     1794        4
2           2       16        4
3           3      885        3
4           3      165        3
5           2     1196        3
6           2      590        2
7           5     1475        2
8           3      165        4
9           4     2392        4
10          2      190        3
11          2      590        3
12          5      130        4
13          5       40        4
14          5       75        1
15          2      590        3
16          4      220        3
17          3     1056        4
18          2     1196        2
19          5      275        3
20          5     1760        1
21          3      102        1
22          4      104        3
23          5      275        1
24          4       32        2
25          4     1180        2
26          2     1196        3
27          2       16        3
28          3       24        4
29          3      165        4
..        ...      ...      ...
970         3      885        4
971         5     1760        1
972         2      590        2
973         1       55        3
974         3      102        2
975         2      590        1
976         5      170        2
977         5      170        4
978         2       68        1
979         1       26        2
980         3     1794        1
981         4      136        2
982         3     1056        2
983         4     2392        4
984         5     2990        3
985         2      110        3
986         2       16        2
987         4     1408        1
988         3      885        2
989         1       55        1
990         3      102        2
991         3       45        1
992         2      704        1
993         3      885        3
994         2       68        2
995         5     2990        1
996         4     1180        1
997         5       75        3
998         4       80        2
999         4      380        3

[1000 rows x 8 columns]>

In [67]:
df.WHEN.dtype

dtype('<M8[ns]')

In [99]:
# Use .dt.month to call just the months
df["QUARTER"] = df["WHEN"].dt.quarter
df['MONTH'] = df["WHEN"].dt.month
df.head()

,Transid,WHEN,WHERE,WHAT,HOW,QUANTITY,REVENUE,QUARTER,MONTH
0,1,2002-11-30,Paris,Exploring in 10 Easy Lessons,Store,4,80,4,11
1,2,2002-10-20,London,Camel saddle,Catalog,3,1794,4,10
2,3,2002-11-07,Paris,Compass,Store,2,16,4,11
3,4,2002-07-28,London,Geo positioning system,Store,3,885,3,7
4,5,2002-08-05,Paris,Hammock,Store,3,165,3,8

#### a) What was the value of catalog sales for London in the first quarter?

pd.pivot_table(df, index = ["WHERE", "HOW", 'QUARTER'], values = 'REVENUE', aggfunc = np.sum, margins=True, margins_name = 'Total')

#### b) What percent of the total annual sales were Tokyo Web sales in the fourth quarter?

In [76]:
pd.pivot_table(df, index = ["WHERE", "HOW", 'QUARTER'], values = 'REVENUE', aggfunc = np.sum, margins=True, margins_name = 'Total')

                           REVENUE
WHERE    HOW     QUARTER
London   Catalog 1          7810.0
                 2         11939.0
                 3         13740.0
                 4         16821.0
         Store   1         46399.0
                 2         22447.0
                 3         38745.0
                 4         43424.0
         Web     1           773.0
                 2          3233.0
                 3          5820.0
                 4          3183.0
New York Catalog 1           497.0
                 2          3568.0
                 3          3126.0
                 4          1521.0
         Store   1          7024.0
                 2          7313.0
                 3          6980.0
                 4          6743.0
         Web     1           136.0
                 2          1437.0
                 3           458.0
                 4           320.0
Paris    Catalog 1          7687.0
                 2          6917.0
                 3         12954.0
                 4          4608.0
         Store   1         24709.0
                 2         29749.0
                 3         32341.0
                 4         17284.0
         Web     1          2197.0
                 2          3563.0
                 3          1160.0
                 4           134.0
Sydney   Catalog 1           989.0
                 2          2371.0
                 3          1031.0
                 4          1080.0
         Store   1          3397.0
                 2          5328.0
                 3          5458.0
                 4          7586.0
         Web     2          2645.0
                 3           104.0
Tokyo    Catalog 1          2767.0
                 2          3168.0
                 3          3246.0
                 4          2922.0
         Store   1         12502.0
                 2         12058.0
                 3          5535.0
                 4         12515.0
         Web     1           138.0
                 2            45.0
                 3          1760.0
                 4            60.0
Total                     483465.0

In [77]:
60/483465

0.00012410412335949863

#### c) What percent of Sydney's annual sales was its Catalog sales?

In [83]:
pd.pivot_table(df[df["WHERE"]=='Sydney'],
               index = ["WHERE", "HOW"], 
               values = 'REVENUE', 
               aggfunc = np.sum, margins=True, margins_name = 'Total')

                REVENUE
WHERE  HOW
Sydney Catalog   5471.0
       Store    21769.0
       Web       2749.0
Total           29989.0

In [84]:
5471/29989

0.18243355897162292

#### e) What was the value of Camel saddle sales for Paris in 2002 by quarter?

In [103]:
pd.pivot_table(df[(df['WHERE']=="Paris") & (df['WHAT']=="Camel saddle")],
                index = ['WHAT',"QUARTER"], 
                values = "REVENUE",
                aggfunc = np.sum, margins = True, margins_name = "Total" )

                      REVENUE
WHAT         QUARTER
Camel saddle 1        13156.0
             2        14950.0
             3        24518.0
             4         8372.0
Total                 60996.0

#### f) How many Elephant polo sticks were sold in New York in each month of 2002?

In [102]:
pd.pivot_table(df[(df['WHERE']=="New York") & (df['WHAT']=="Elephant polo stick")],
                index = ['WHAT',"MONTH"],
                values = "REVENUE",
                aggfunc = np.sum, margins = True, margins_name = "Total" )

                           REVENUE
WHAT                MONTH
Elephant polo stick 3       1760.0
                    4       2464.0
                    5        704.0
                    7        352.0
                    8       1760.0
                    9        704.0
                    12      2464.0
Total                      10208.0